app/views/artists/index.html.erb

SELECT "artists".* FROM "artists"
---

  <#% @artists.sort_artists(@preference).each do |artist| %> -->