app/controllers/admin/access_controller.rb

SELECT COUNT(*) FROM "preferences"
---
  def index
    if Preference.all.empty?