app/controllers/admin/access_controller.rb

INSERT INTO "preferences" ("allow_create_songs", "allow_create_artists", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["allow_create_songs", "t"], ["allow_create_artists", "t"], ["created_at", "2016-03-31 05:44:35.767970"], ["updated_at", "2016-03-31 05:44:35.767970"]]
SELECT  "preferences".* FROM "preferences" WHERE "preferences"."allow_create_songs" = ? AND "preferences"."allow_create_artists" = ? LIMIT 1  [["allow_create_songs", "t"], ["allow_create_artists", "t"]]
---
  def index
    @preference = Preference.first || Preference.create(allow_create_artists: true, allow_create_songs: true)

SELECT  "preferences".* FROM "preferences" WHERE "preferences"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "preferences" SET "allow_create_songs" = ?, "allow_create_artists" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["allow_create_songs", "f"], ["allow_create_artists", "t"], ["updated_at", "2016-02-02 00:17:49.602109"], ["id", 1]]
---
  def update
    @preference = Preference.find(params[:id])
    @preference.update(preference_params)