app/controllers/admin/preferences_controller.rb

SELECT  "preferences".* FROM "preferences" WHERE (1) LIMIT 1
UPDATE "preferences" SET "artist_sort_order" = ?, "song_sort_order" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["artist_sort_order", "DESC"], ["song_sort_order", "DESC"], ["updated_at", "2016-04-06 20:59:46.461778"], ["id", 1]]
---
  def update
binding.pry
    pref=Preference.find_by(params[:id])
    pref.update(preferences_params)