app/controllers/admin/settings_controller.rb

  def index
# binding.pry
    if Preference.all.empty?
      @preference = Preference.create
---
SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "preferences"
INSERT INTO "preferences" ("song_sort_order", "artist_sort_order", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["song_sort_order", "DESC"], ["artist_sort_order", "DESC"], ["created_at", "2016-02-01 23:06:05.250325"], ["updated_at", "2016-02-01 23:06:05.250325"]]

  def update
    preference=Preference.find(params[:id])
# binding.pry
    preference.update(preference_params)
---
SELECT  "preferences".* FROM "preferences" WHERE "preferences"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "preferences" SET "artist_sort_order" = ?, "song_sort_order" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["artist_sort_order", "{:value=>\"DESC\"}"], ["song_sort_order", "{:value=>\"DESC\"}"], ["updated_at", "2016-03-31 19:06:09.398683"], ["id", 1]]