app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"  ORDER BY "artists"."name" DESC
SELECT "artists".* FROM "artists"
---
  def index
    #binding.pry
    #if preferences exist, and there is a artist_sort_order attribute for preferences
    if @preferences && @preferences.artist_sort_order
        #create a variable with a hash of all of the Artists that are orders by name, depending on the artist_sort_order attribute for the preferences)
        @artists = Artist.order(name: @preferences.artist_sort_order)
    else
            @artists = Artist.all

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
---
  def set_preferences
        @preferences = Preference.first